Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the ear element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the ear element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ།
en: Householder, in this regard the Thus-Gone One accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: བདེ་བ་ལ་བཙུད་པ་ནི་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: That is the knowledge of cessation as related to knowledge of the ear element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the ear element.

source: དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the ear element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་དེའི་སྤོབས་པ་ཟད་མི་ཤེས་སོ། །
en: he can respond for an eon, and so forth, since his eloquence is inexhaustible.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the ear element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་རྣ་བའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the ear element.

source: དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the ear element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the sound element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འབྱུང་བ་ཆེན་པོ་ལ་ཤིན་ཏུ་བརྟེན་པའི་སྒྲའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the sound element which is entirely dependent on the main elements.

source: སྒྲ་སྙན་པ་ཉིད་དང་། སྒྲ་མི་སྙན་པ་ཉིད་དང་། སྒྲ་སྙན་ཅིང་འཇེབས་པ་ཉིད་དང་། སྒྲ་སྙན་ཅིང་འཇེབས་པ་མ་ཡིན་པ་ཉིད་དང་། སྒྲ་ཡིད་དུ་འོང་བ་ཉིད་དང་། སྒྲ་ཡིད་དུ་མི་འོང་བ་ཉིད་དང་། སྒྲ་ཉན་པར་འོས་པ་ཉིད་དང་། སྒྲ་དགའ་བར་བྱེད་པ་ཉིད་དང་། སྒྲ་མི་འཐུན་པ་ཉིད་དང་། སྒྲ་འཐུན་པ་མ་ཡིན་པ་ཉིད་དང་། དུང་གི་སྒྲ་དང་། རྔ་བོ་ཆེའི་སྒྲ་དང་། རྫ་རྔའི་སྒྲ་དང་། འཁར་རྔའི་སྒྲ་དང་། ཆུ་སྒྲ་རྣམ་པར་གོ་བར་བྱེད་པའི་སྒྲ་དང་། མེའི་སྒྲ་དང་། ཆུའི་སྒྲ་དང་། རླུང་གི་སྒྲ་དང་། འབྲུག་སྒྲ་འུར་འུར་པོ་དང་། གློག་ལས་བྱུང་བའི་སྒྲ་དང་། སེར་བ་འབབ་པའི་སྒྲ་དང་། ཟིན་པ་དང་མ་ཟིན་པ་དག་གི་འབྱུང་བ་ཆེན་པོ་འདུས་པའི་སྒྲ་འདི་ནི་སྒྲའི་ཁམས་ཞེས་བྱ་སྟེ
en: It consists of pleasant sounds, unpleasant sounds, prolonged pleasant sounds, abrupt pleasant sounds, beautiful sounds, awful sounds, sounds that should be heard, delightful sounds, disagreeable sounds, offensive sounds, the sounds of a conch, the sounds of a drum, the sounds of a hand drum, the sounds of a gong, the murmur of a stream, sounds that cause understanding, the sound of fire, the sound of water, the sound of wind, claps of thunder, the sound of lightning, the sound of hailstorms, as well as all other sounds of the main elements, whether embraced by the mind or not. Such is the sound element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་སྒྲའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the sound element, and

source: དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the sound element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the sound element.

source: སྒྲའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དང་།
en: how to gain knowledge of the origin as related to knowledge of the sound element,

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ། རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་སྒྲའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the sound element.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་སྒྲའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the sound element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the sound element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་། དོན་མ་ཡིན་པ་བཟློག་ལ་
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: བདེ་བ་ལ་བཙུད་པ་ནི་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: established them in happiness. That is the knowledge of cessation as related to knowledge of the sound element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the sound element.

source: དེ་བཞིན་གཤེགས་པ་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the sound element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the sound element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་སྒྲའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the sound element.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance, the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པས་སྒྲའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the sound element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the ear consciousness element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands it in this way.

source: རྣ་བ་དང་སྒྲ་ལ་བརྟེན་ནས་རྣ་བའི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: Based on the ear and sound, the ear consciousness manifests.

source: རྣ་བའི་ནང་ནས་ཀྱང་མ་བྱུང་།
en: the ear consciousness does not appear from within the ear.

source: ཕྱི་རོལ་གྱི་སྒྲ་དག་ལས་ཀྱང་མ་འོངས་བར་དུ་རྣམ་པར་བཟུང་སྟེ་ཡང་མི་གནས་མོད་ཀྱི་
en: It also does not appear from the outer sounds and neither is it maintained somewhere in between.

source: འོན་ཀྱང་ཚོགས་པའི་དབང་གིས་རྣ་བའི་རྣམ་པར་ཤེས་པ་སྐྱེས་ལ།
en: Nevertheless, due to their combination, the ear consciousness does manifest.

source: དེ་འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་ལ།
en: It is beyond coming and going.

source: སྟོང་ཞིང་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ནོ། །
en: It is empty and without essence.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the ear consciousness element .

source: དེ་བཞིན་གཤེགས་པ་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the ear consciousness element,

source: བསྐལ་པར་ལན་གསུང་ཞིང་། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the ear consciousness element.

source: རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དང་
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the ear consciousness element,

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the ear consciousness element.

source: དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the ear consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the ear consciousness element.

source: བདེ་བ་ལ་བཙུད་པ་ནི་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: established them in happiness. That is the knowledge of cessation as related to knowledge of the ear consciousness element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the ear consciousness element.

source: དེ་བཞིན་གཤེགས་པ་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the ear consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the ear consciousness element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་ནས།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the ear consciousness element.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ།
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance,

source: དེ་བཞིན་གཤེགས་པས་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the ear consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the nose element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, this is how the Thus-Gone One correctly understands it.

source: ཟིན་པའི་འབྱུང་བ་ཆེན་པོའི་རྒྱུར་བྱས་པ་དང་བ་གང་ཡིན་པ་ནི། སྣའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The nose is the ripening of subtle matter derived from the primary elements conjoined with mind.

source: གང་གི་སྣ་ལ་དྲི་སྣང་བར་འགྱུར་ཞིང་
en: Within the nose, smells are perceived.

source: དྲི་ཡང་ཐོགས་པ་དང་། སྣ་གང་དྲི་དག་ལ་ཐོགས་པ་དང་།
en: The nose is obstructed by smells, and it obstructs smells.

source: སྣ་གང་གིས་དྲི་བསྣམས་པ་དང་། སྣོམ་པ་དང་། སྣོམ་པར་འགྱུར་བ་དང་།
en: The nose has smelled, it smells, and it will smell.

source: དྲི་དག་བསྣམ་པའི་ཕྱིར་ཡང་ཐ་མི་དད་ཅིང་རུང་བའི་སྣ་གང་ཡིན་པ་དང་།
en: In order to perceive smells, the nose is undifferentiated.

source: ཁམས་བཅྭ་བརྒྱད་དག་ལས་སྣའི་ཁམས་གང་ཡིན་པ་དང་།
en: The nose is also included within the eighteen elements as the nose element.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ལས་སྣའི་སྐྱེ་མཆེད་གང་ཡིན་པ་དང་།
en: Among the twelve sense sources it is the nose sense source.

source: དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་དག་ལས་སྣའི་དབང་པོ་གང་ཡིན་པ་སྟེ།
en: Among the twenty-two faculties it is the nose faculty.

source: དེ་ནི་སྣ་ཡང་ཡིན།
en: It is the nose;

source: དེ་ནི་སྣའི་ཁམས་ཀྱང་ཡིན།
en: it is the nose element;

source: དེ་ནི་སྣའི་སྐྱེ་མཆེད་ཀྱང་ཡིན།
en: it is the nose sense source.

source: དེ་ནི་སྣའི་དབང་པོ་ཡང་ཡིན།
en: It is the nose faculty.

source: དེ་ནི་འབྱུང་བ་ཡང་ཡིན།
en: It is a water source.

source: དེ་ནི་དངོས་པོ་ཡང་ཡིན།
en: It is an entity.

source: འདི་ནི་སྣའི་ཁམས་ཞེས་བྱའོ། །
en: It is known as the nose element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་སྣའི་ཁམས་མཁྱེན་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the nose element .

source: དེ་བཞིན་གཤེགས་པས་སྣའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the nose element,

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the nose element.

source: སྣའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དང་།
en: The Thus-Gone One has gained knowledge of the origin as related to knowledge of the nose element,

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་སྣའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the nose element.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the nose element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the nose element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་མཛད་ཅིང་དོན་མ་ཡིན་པ་ཟློག་ལ།
en: Householder, in this regard the Thus-Gone One accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: སྣང་བ་མཛད་ཅིང་མུན་པ་བསལ་ཏེ།
en: He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ནས།
en: He has freed innumerable beings from suffering and

source: བདེ་བ་ལ་བཙུད་པ་ནི་སྣའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: established them in happiness. That is the knowledge of cessation as related to knowledge of the nose element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the nose element.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the nose element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་སྣའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the nose element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་མཛད་པའི་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge by which he knows, understands, and actualizes the knowledge of the nose element.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the nose element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲིའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the smell element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སྣའི་ཡུལ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the object of the nose in this way:

source: འདི་ལྟ་སྟེ། དྲི་ཞིམ་པ་དང་། དྲི་ང་བ་དང་། དྲི་འདོད་པ་དང་། དྲི་སྡུག་པ་དང་། དྲི་མི་སྡུག་པ་དང་། དྲི་ཡིད་དུ་འོང་བ་དང་། དྲི་ཡིད་དུ་མི་འོང་བ་དང་། དྲི་ཡིད་དུ་འཐད་པ་དང་། དྲི་ཡིད་དུ་མི་འཐད་པ་དང་། དྲིའི་ངོ་བོ་དགའ་བ་དང་། དྲིའི་ངོ་བོ་མི་དགའ་བ་དང་། དྲིའི་ངོ་བོ་ལེགས་པ་དང་། དྲིའི་ངོ་བོ་མི་ལེགས་པ་དང་། སྣོད་ན་ཡོད་པ་དང་། རྩ་བ་ལ་ཡོད་པ་དང་། སྙིང་པོ་ལ་ཡོད་པ་དང་། སྙིང་པོ་མེད་པ་ལ་ཡོད་པ་དང་། ཤུན་པ་ལ་ཡོད་པ་དང་། ངར་བ་ལ་ཡོད་པ་དང་། ལོ་མ་ལ་ཡོད་པ་དང་། མེ་ཏོག་ལ་ཡོད་པ་དང་། འབྲས་བུ་ལ་ཡོད་པའི་དྲི་གང་ཡིན་པ་འདི་ནི་དྲིའི་ཁམས་ཞེས་བྱ་སྟེ
en: It consists of pleasant smells, unpleasant smells, desirable smells, sweet smells, awful smells, agreeable smells, disagreeable smells, enjoyable smells, displeasing smalls, delightful smells, offensive smells, fine smells, rough smells, as well as all other smells found in the environment, such as the smells of roots, kernels, hollow plants, bark, stems, leaves, flowers, and fruits. All of these are known as the smell element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་དྲིའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the smell element .

source: དེ་བཞིན་གཤེགས་པ་དྲིའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the smell element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲིའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the smell element.

source: དྲིའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ།
en: The Thus-Gone One has gained knowledge of the origin as related to knowledge of the smell element,

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་དྲིའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the smell element.

source: དེ་བཞིན་གཤེགས་པ་དྲིའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the smell element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་བའི་བར་དུའོ། །
en: he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲིའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the smell element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་། དོན་མ་ཡིན་པ་བཟློག་ལ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: བདེ་བ་ལ་བཙུད་པ་ནི་དྲིའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: established them in happiness. That is the knowledge of cessation as related to knowledge of the smell element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲིའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the smell element.

source: དེ་བཞིན་གཤེགས་པ་དྲིའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the smell element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since
